IDEA Connection Link
ConnectionSrv.SetAndOpenIdeaConProjectFile Method
 OpenIdeaConProjectFile
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void SetAndOpenIdeaConProjectFile(
	byte[] ideaConFile,
	int unitProfile
)
Public Sub SetAndOpenIdeaConProjectFile (
	ideaConFile As Byte(),
	unitProfile As Integer
)
public:
void SetAndOpenIdeaConProjectFile(
	array<unsigned char>^ ideaConFile,
	int unitProfile
)
Parameters
ideaConFile
Type: System.Byte[]
Idea connection file stream
unitProfile
Type: System.Int32
Unit profiel 0 for ISO, 1 for imperial
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace